1s/ERP/Conf/InformationRegisters/Лико_Цветоделение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_Цветоделение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цветоделитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корректор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корректор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаименований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовОфсет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовФлексо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовВысокая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовГлубокая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовИндиго</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЦветовТрафарет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКонгревов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТиснений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТиснениеНФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТиснениеГалакси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТиснениеГолография</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переделка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЦветоделения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКорректировки1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКорректировки2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентКорректора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветоделительПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийЦветоделитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоррекцияЦветоделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВозвратаНаПовторноеЦветоделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПричиныВозвратаНаПовторноеЦветоделение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредыдущийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_Цветоделение/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заказ") Тогда
		Заказ = Параметры.Заказ;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Заказ", Заказ, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Заказ));	
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") 
		И ПользователиКлиентСервер.ТекущийПользователь().Лико_Площадки.НайтиСтроки(Новый Структура ("Площадка",Справочники.Лико_Площадки.Ликофлекс)).Количество() = 0 Тогда
		Если НЕ РольДоступна("Лико_ПланОДП") Тогда
			Элементы.СтраницаСписокВерсия2.Видимость = Ложь;
		КонецЕсли;
		Если НЕ РольДоступна("Лико_ПланЦДП") Тогда
			Элементы.СтраницаСписокВерсия3.Видимость = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	текстр = Элемент.ТекущиеДанные;
	Если текстр<> Неопределено Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",текстр.Заказ);
		ПараметрыФормы.Вставить("Идентификатор",текстр.НомерЗаявки);	
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаЗаявкиНаЦветоделение", ПараметрыФормы);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НомерЗаказа", НомерЗаказа, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(НомерЗаказа));
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(НомерЗаказа) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборВерсияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Версия", Версия, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Версия));
КонецПроцедуры

&НаКлиенте
Процедура ОтборВерсияОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Версия) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Менеджер", Менеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Менеджер));
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборСрочныйПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Срочный", Срочный, ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЦифровойПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Цифровой", Цифровой, ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦветоделителя(Команда)
	
	Если Команда.Имя = "ИзменитьЦветоделителя" Тогда
		
		Если Элементы.СписокВерсия2.ВыделенныеСтроки.Количество() > 0 Тогда
			
			ПараметрыЗаказа = Новый Структура("ВыделенныеСтроки,ИмяКоманды", Элементы.СписокВерсия2.ВыделенныеСтроки,Команда.Имя);

			ПараметрыФормыВыбора = Новый Структура;    
			ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
			ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина); 
			// <-- Начало Лико Яцун С. В. 17.02.2023
			ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ГруппаПользователейОДП.ЗначениеПараметра"));
			//ПараметрыФормыВыбора.Вставить("СкрываемыеПользователи", ОтборПользователейПоРолям("Лико_ПланОДП"));
			// <-- Конец Лико Яцун С. В. 17.02.2023
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормыВыбора,,,,, Новый ОписаниеОповещения("ВыбранЦветоделитель", ЭтотОбъект, ПараметрыЗаказа));
			
		КонецЕсли;
	// <-- Начало Лико Яцун С. В. 17.02.2023	
	ИначеЕсли Команда.Имя = "ИзменитьЦветоделителяЦДП" Тогда
		
		Если Элементы.СписокВерсия3.ВыделенныеСтроки.Количество() > 0 Тогда
			
			ПараметрыЗаказа = Новый Структура("ВыделенныеСтроки,ИмяКоманды", Элементы.СписокВерсия3.ВыделенныеСтроки,Команда.Имя);
			
			ПараметрыФормыВыбора = Новый Структура;    
			ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
			ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина); 
			ПараметрыФормыВыбора.Вставить("СкрываемыеПользователи", ОтборПользователейПоРолям("Лико_ПланЦДП"));
			
			
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормыВыбора,,,,, Новый ОписаниеОповещения("ВыбранЦветоделитель", ЭтотОбъект, ПараметрыЗаказа));
			
		КонецЕсли;
		
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 17.02.2023
КонецПроцедуры

&НаСервере
Функция ОтборПользователейПоРолям(ИмяРоли) // <-- Начало Лико Яцун С. В. 17.02.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкрываемыеПользователи = Новый СписокЗначений;
	ПлощадкиТекПользователя = Новый СписокЗначений();
	Для Каждого Пл Из ПользователиКлиентСервер.ТекущийПользователь().Лико_Площадки Цикл
		ПлощадкиТекПользователя.Добавить(Пл.Площадка);		
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрофилиГруппДоступаРоли.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Профили
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|ГДЕ
	|	ВЫРАЗИТЬ(ПрофилиГруппДоступаРоли.Роль КАК Справочник.ИдентификаторыОбъектовМетаданных).Имя = &Роль
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрофилиГруппДоступаРоли.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Группы
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Профиль В
	|			(ВЫБРАТЬ
	|				ВТ_Профили.Ссылка
	|			ИЗ
	|				ВТ_Профили)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ГруппыДоступаПользователи.Пользователь КАК Справочник.Пользователи) КАК Пользователь
	|ПОМЕСТИТЬ ВТ_НужныеПользователи
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Группы.Ссылка
	|			ИЗ
	|				ВТ_Группы)
	|	И ВЫРАЗИТЬ(ГруппыДоступаПользователи.Пользователь КАК Справочник.Пользователи).Лико_Площадки.Площадка В (&ПлощадкиТекущегоПользователя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ГруппыДоступаПользователи.Пользователь КАК Справочник.Пользователи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_НужныеПользователи.Пользователь КАК Пользователь
	|				ИЗ
	|					ВТ_НужныеПользователи КАК ВТ_НужныеПользователи)";
	
	Запрос.УстановитьПараметр("Роль",ИмяРоли);
	Запрос.УстановитьПараметр("ПлощадкиТекущегоПользователя",ПлощадкиТекПользователя);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СкрываемыеПользователи.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
	Возврат СкрываемыеПользователи;
	
КонецФункции // <-- Конец Лико Яцун С. В. 17.02.2023

&НаКлиенте
Процедура ВыбранЦветоделитель(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДопПараметры.Вставить("НовыйЦветоделитель", Результат);
		ИзменитьЦветоделителяНаСервере(ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦветоделителяНаСервере(ПараметрыЗаказа)
	
	Для каждого КлючЗаписи из ПараметрыЗаказа.ВыделенныеСтроки Цикл
		ЗаказКлиента = КлючЗаписи.Заказ;
		СтрокаЦветоделения = ЗаказКлиента.Цветоделение.Найти(КлючЗаписи.Идентификатор, "КлючСтроки");
		Если СтрокаЦветоделения = Неопределено Тогда
			Сообщить("Не найдена строка цветоделения в заказе по указанному ключу строки (" + ЗаказКлиента + " " + КлючЗаписи.Идентификатор + ")");
		Иначе
			ТекущийЦветоделитель = СтрокаЦветоделения.ЦветоделительПлан;
			Если ТекущийЦветоделитель = ПараметрыЗаказа.НовыйЦветоделитель Тогда
				Сообщить("Для заказа " + ЗаказКлиента.НомерБезПрефикса + " вы выбрали того же самого цветоделителя");
			Иначе
				ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
				СтрокаЦветоделения = ЗаказОбъект.Цветоделение[СтрокаЦветоделения.НомерСтроки-1];
				СтрокаЦветоделения.ЦветоделительПлан = ПараметрыЗаказа.НовыйЦветоделитель;
				Попытка
					ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
					Сообщить("Для заказа " + ЗаказОбъект.НомерБезПрефикса + ?(ЗначениеЗаполнено(СтрокаЦветоделения.Переделка), " (переделка №" + СтрокаЦветоделения.Переделка + ")", "") + ?(ЗначениеЗаполнено(ТекущийЦветоделитель), " цветоделитель успешно изменен с """ + ТекущийЦветоделитель + """ на """, " цветоделителем успешно установлен """) + ПараметрыЗаказа.НовыйЦветоделитель + """");
					Если ПараметрыЗаказа.ИмяКоманды = "ИзменитьЦветоделителя" Тогда
						Элементы.СписокВерсия2.Обновить();
					ИначеЕсли ПараметрыЗаказа.ИмяКоманды = "ИзменитьЦветоделителяЦДП" Тогда
						Элементы.СписокВерсия3.Обновить();
					КонецЕсли;	
				Исключение
					Сообщить("Не удалось изменить цветоделителя: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НаправитьНаПроизводствоНаСервере(Заказ,ИмяКоманды)
	
	Лико_Планирование.ПеренестиЗаказ(Заказ, Справочники.Лико_ЭтапыВыполненияЗаказа.Производство);
	Если ИмяКоманды = "НаправитьНаПроизводство" Тогда 
		Элементы.СписокВерсия2.Обновить();
	ИначеЕсли ИмяКоманды = "НаправитьНаПроизводствоЦДП" Тогда
		Элементы.СписокВерсия3.Обновить();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура НаправитьНаПроизводство(Команда)
	
	Если Команда.Имя = "НаправитьНаПроизводство" Тогда
		текстр = Элементы.СписокВерсия2.ТекущиеДанные;
		Если текстр <> Неопределено Тогда 
			НаправитьНаПроизводствоНаСервере(текстр.Заказ,Команда.Имя);
		КонецЕсли;
	// <-- Начало Лико Яцун С. В. 
	ИначеЕсли Команда.Имя = "НаправитьНаПроизводствоЦДП" Тогда
		текстр = Элементы.СписокВерсия3.ТекущиеДанные;
		Если текстр <> Неопределено Тогда 
			НаправитьНаПроизводствоНаСервере(текстр.Заказ,Команда.Имя);
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В.
	
КонецПроцедуры
